# Task 2
# Написать свой класс для хранения информации об автомобиле: фирма, модель, год выпуска, объем двигателя, цвет

class CarInfo:
    brand = "Tesla"
    model = "Model Y"
    year = 2025
    engine = "Electric"
    horsepower = "188 to 274 kW"
    color = "Grey"
    
ci = CarInfo()
print(ci.brand)
print(ci.model)
print(ci.color)
print(ci.engine)
print(ci.horsepower)
print(ci.year)
