# TEST TASK

# Task 1
# Как работает код ?

def add_number_to_string(str, number):
    return str + str(number)

# Тут происходит объединение строк (конкатенация). Но чтобы их объединить нужно сначала число преобразовать в строку, 
# это и делает str(number). Ну и с помощью return возвращаем результат.

# -------------------------------------------------------------------------------------------------------------------------------------#
# Task 2
# Как работает код ?

def switch_light(was):
    if was == 'red':
        return 'green'
    if was == 'green':
        return 'yellow'
    return 'red'

# У нас на входе есть единственный параметр was. В зависимости от его значения мы сравниваем в помощью оператора if: 
# если значение красный, то выводим зеленый. Если зеленый, то выводим желтый. Если was не красный и не зеленый, 
# то по умолчанию возвращаем красный.

# -------------------------------------------------------------------------------------------------------------------------------------#
# Task 3
# Как работает код ?

def subtract_string(str, substr):   # no :
    for letter in substr:
        if letter in substr:
            str.replace(letter, '')
            
# И тут синтаксическая ошибка, нет ":" . тут проходим по каждому символу в строке substr, и если символ совпадает, 
# то заменяем его на пустую строку и сохраняем результат. После завершения цикла функция вернет измененную строку без найденных символов.
            
# -------------------------------------------------------------------------------------------------------------------------------------#                  
# Task 4
# Как работает код ?

def calculate_summ(array):
    if len(array):
        result = array[0]
        for elem in array[1:]:
            result += elem
    print(result)
    
# 

# -------------------------------------------------------------------------------------------------------------------------------------#
# Task 5
# Как работает код ?

def calculate_summ(array):
    result = None
    if len(array):
        result = array[0]
        for elem in array[1:]:
            if result > elem:
                result = elem
    return result

# -------------------------------------------------------------------------------------------------------------------------------------#
# Task 6
# Как работает код ?

def binary_search(array, element):
    middle = len(array) // 2
    if element > array[middle]:
        return binary_search(array[middle:], element)
    if element < array[middle]:
        return binary_search(array[:middle], element)
    return middle

# -------------------------------------------------------------------------------------------------------------------------------------#
# Task 7
# Как работает код ?

def good_function(txt, change='bad', to='good'):
    return txt.replace('bad', 'good')

print(good_function('I am a bad girl.'))

# -------------------------------------------------------------------------------------------------------------------------------------#
# Task 8
# Как работает код ?

def ideal_function(
    prompt_text='Vvedite celoe chislo: '):
    result = None
    while(result is None):
        try:
            result = int(input(prompt_text))
        except:
            print('Eto ne bylo celym chislom.')
    return result

# -------------------------------------------------------------------------------------------------------------------------------------#
# Task 9
# Как работает код ?

def decorator(func, p1, p2):
    print('Calling func(' + str(p1) + ', ' + str(p2) + ')')
    func(p1, p2)
    
result = decorator(sum, 5, 6)
if result == 11:
    print('Test passed')

# -------------------------------------------------------------------------------------------------------------------------------------#
# Task 10
# Как работает код ?

print(map(
    float,
    ['6.7', '2.2', '8', '14', '22']
))

# -------------------------------------------------------------------------------------------------------------------------------------#