# Есть три кортежа целых чисел необходимо найти элементы, которые уникальны для каждого списка.

# Берем три кортежа
tuple1 = (1, 2, 3, 4, 5)
tuple2 = (3, 4, 5, 6, 7)
tuple3 = (4, 5, 8, 9)

# Преобразуем кортежи в множества
set1 = set(tuple1)
set2 = set(tuple2)
set3 = set(tuple3)

# Находим уникальные элементы для каждого кортежа
unique1 = set1 - (set2 | set3)
unique2 = set2 - (set1 | set3)
unique3 = set3 - (set1 | set2)

print("Уникальные элементы 1:", unique1)
print("Уникальные элементы 2:", unique2)
print("Уникальные элементы 3:", unique3)